БухЭксп/Catalogs/CW_НовостиКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НовостиКомпании</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНовости</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание_RU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание_EN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема_EN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема_RU</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСодержания</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательЛКК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ВебПользователиЛКК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НовостиКомпании/Ext/ManagerModule.bsl
Процедура ВыполнитьКонвертациюНовостей() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НовостиКомпании.Ссылка КАК Ссылка,
	               |	CW_НовостиКомпании.Содержание_RU КАК Содержание_RU,
	               |	CW_НовостиКомпании.Содержание_EN КАК Содержание_EN
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании КАК CW_НовостиКомпании";  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовостьОбъект = Выборка.Ссылка.ПолучитьОбъект();   
		
		ФорматированныйДокумент_RU = новый ФорматированныйДокумент;  
		ФорматированныйДокумент_RU.УстановитьHTML(Выборка.Содержание_RU, новый Структура);
		
		ФорматированныйДокумент_EN = новый ФорматированныйДокумент;  
		ФорматированныйДокумент_EN.УстановитьHTML(Выборка.Содержание_EN, новый Структура);

		ХранилищеСодержания = Новый Структура;
		ХранилищеСодержания.Вставить("ru", ФорматированныйДокумент_RU);
		ХранилищеСодержания.Вставить("en", ФорматированныйДокумент_EN);   
		
		НовостьОбъект.ХранилищеСодержания = новый ХранилищеЗначения(ХранилищеСодержания); 
		НовостьОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьАктуальныеНовости(Пользователь, Язык="ru") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_НовостиКомпанииСписокПользователей.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ОбщиеНовости
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании.СписокПользователей КАК CW_НовостиКомпанииСписокПользователей
	               |ГДЕ
	               |	CW_НовостиКомпанииСписокПользователей.ПользовательЛКК = ЗНАЧЕНИЕ(Справочник.CW_ВебПользователиЛКК.ПустаяССылка)
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ДатаНовости <= &ДатаНовости
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_НовостиКомпанииСписокПользователей.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_НовостиПользователя
	               |ИЗ
	               |	Справочник.CW_НовостиКомпании.СписокПользователей КАК CW_НовостиКомпанииСписокПользователей
	               |ГДЕ
	               |	CW_НовостиКомпанииСписокПользователей.ПользовательЛКК = &Пользователь
	               |	И CW_НовостиКомпанииСписокПользователей.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОбщиеНовости.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_НовостиДляОтображения
	               |ИЗ
	               |	ВТ_ОбщиеНовости КАК ВТ_ОбщиеНовости
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_НовостиПользователя.Ссылка
	               |ИЗ
	               |	ВТ_НовостиПользователя КАК ВТ_НовостиПользователя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_НовостиДляОтображения.Ссылка) КАК Ссылка,
	               |	ВТ_НовостиДляОтображения.Ссылка.ДатаНовости КАК Дата,
	               |	ВЫБОР
	               |		КОГДА &Язык = ""en""
	               |			ТОГДА ВТ_НовостиДляОтображения.Ссылка.Тема_EN
	               |		ИНАЧЕ ВТ_НовостиДляОтображения.Ссылка.Тема_RU
	               |	КОНЕЦ КАК Тема,
	               |	ВТ_НовостиДляОтображения.Ссылка.Архив КАК Архив,
	               |	ВТ_НовостиДляОтображения.Ссылка.Важность КАК Важность,
	               |	ВЫБОР
	               |		КОГДА ВТ_НовостиДляОтображения.Ссылка.Архив
	               |			ТОГДА 2
	               |		КОГДА ВТ_НовостиДляОтображения.Ссылка.Важность
	               |			ТОГДА 4
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ИндексКартинки
	               |ИЗ
	               |	ВТ_НовостиДляОтображения КАК ВТ_НовостиДляОтображения
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата"; 
	
	Запрос.УстановитьПараметр("Пользователь", 	Пользователь);   
	Запрос.УстановитьПараметр("ДатаНовости", 	ТекущаяДата());   
	Запрос.УстановитьПараметр("Язык", 			Язык);   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции
